Autodesk.Revit.DB.Analysis.EnergyAnalysisOpeningType
Energy analysis opening type.
Since:
2012
Analytical opening types.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisOpeningType.Air
Air.

Autodesk.Revit.DB.Analysis.EnergyAnalysisOpeningType.Skylight
Skylight.

Autodesk.Revit.DB.Analysis.EnergyAnalysisOpeningType.Window
Window.

Autodesk.Revit.DB.Analysis.EnergyAnalysisOpeningType.Door
Door.